// @ts-nocheck
"use strict";

/**
 * @enum {import("discord.js").ColorResolvable} カラーコード
 */
export const 色名 = {
  /** 行動することはできません、戦う相手が見つかりませんなど強調文字 */
  強調: "#FF6",
  /** ダメージの数字 */
  被弾: "#F00",
  /** ○○をたおした！、○○はやられてしまった！ */
  死亡: "#F00",
  /** 回復の数字 */
  回復: "#0CC",
  /* 生き返った */
  蘇生: "#0FF",
  /* ステータス異常 */
  状態異常: "#C9C",
  /* 一時的状態 */
  一時的状態: "#6FC",
  /* テンションの数字 */
  テンション: "#FF0",
  /* ステータス増大 */
  バフ: "#9CF",
  /* ステータス減少 */
  デバフ: "#F99",
  /* レベルが上がった♪ */
  レベルアップ: "#FF0",
  /* 経験値とお金を手に入れた */
  入手: "#9FC",
  /* ささやき */
  ささやき: "#0FF",
  /* 会心の一撃！ */
  会心: "#FFF",
  /* コンプリート */
  コンプリート: "#FF0",
  NPC: ""
}