"use strict";

class クエスト情報 extends 冒険場所の情報 {
  static 初期化() {
    new クエスト情報("プニプニ平原", "stage0.gif", [
      [...アイテム.名前範囲("ひのきの棒", "おおきづち")],
      [...アイテム.名前範囲("布の服", "鎖かたびら")],
      [
        undefined,
        ...new 連続("薬草", 2),
        ...new 連続("上薬草", 2),
        ...アイテム.名前範囲("毒消し草", "天使の鈴"),
        "守りの石",
        ...アイテム.名前範囲("力の種", "素早さの種"),
        "小さなﾒﾀﾞﾙ", "ﾓﾝｽﾀｰ銅貨", "ﾄﾞﾗｺﾞﾝ草", "身代わり人形"
      ]
    ], [
      new 敵情報(undefined, "ﾋﾞｯｸｽﾗｲﾑ", 300, 0, 35, 10, 40, "006", 60, 20)
    ], [
      new 敵情報(6, "ﾌﾞﾁｽﾗｲﾑ", 5, 0, 7, 0, 7, "001", 1, 2),
      new 敵情報(5, "ｽﾗｲﾑ", 7, 0, 11, 0, 9, "002", 2, 2),
      new 敵情報(3, "ｽﾗｲﾑﾍﾞｽ", 8, 0, 15, 0, 10, "003", 3, 2),
      new 敵情報(1, "ﾁﾋﾞｲｴﾃｨ", 11, 0, 12, 0, 20, "200", 4, 2,),
      new 敵情報(1, "ﾄﾞﾗｷｰ", 10, 0, 15, 0, 24, "025", 5, 3, { 命中率: 70, 状態異常名: "混乱" }),
      new 敵情報(1, "ﾋﾟﾖｺ", 12, 0, 12, 0, 16, "120", 6, 4)
    ]);
    new クエスト情報("キノコの森", "stage1.gif", [
      [...アイテム.名前範囲("こんぼう", "銅の剣")],
      [...アイテム.名前範囲("ｽﾃﾃｺﾊﾟﾝﾂ", "ｽﾗｲﾑの服")],
      [
        undefined,
        ...アイテム.名前範囲("薬草", "特薬草"), ...アイテム.名前範囲("薬草", "特薬草"),
        ...アイテム.名前範囲("毒消し草", "魔法の聖水"), ...アイテム.名前範囲("毒消し草", "魔法の聖水"),
        ...アイテム.名前範囲("力の種", "ｽｷﾙの種"),
        "小さなﾒﾀﾞﾙ", "ﾓﾝｽﾀｰ銅貨", "ﾄﾞﾗｺﾞﾝ草", "爆弾石", "竜のｳﾛｺ", "守りのﾙﾋﾞｰ"
      ]
    ], [
      new 敵情報(undefined, "ﾄﾞｸｷﾉｺA", 30, 29, 20, 10, 11, "031", 15, 12, "猛毒系", 10),
      new 敵情報(undefined, "人面樹", 500, 63, 40, 20, 25, "503", 90, 60, "商人", 20),
      new 敵情報(undefined, "ﾄﾞｸｷﾉｺB", 30, 29, 20, 10, 11, "031", 15, 12, "猛毒系", 10)
    ], [
      new 敵情報(3, "ﾅｽﾋﾞｰﾗ", 140, 0, 16, 0, 25, "050", 4, 4),
      new 敵情報(4, "ｵﾊﾞｹｷﾉｺ", 15, 0, 18, 9, 12, "030", 5, 4),
      new 敵情報(3, "ﾄﾞｸｷﾉｺ", 18, 29, 14, 8, 10, "031", 6, 7, "猛毒系", 10),
      new 敵情報(1, "ﾍﾞﾋﾞｰﾊﾟﾝｻｰ", 20, 0, 22, 7, 24, "206", 8, 3),
      new 敵情報(2, "ﾄﾞﾗｷｰ", 15, 0, 20, 0, 35, "025", 5, 3, { 命中率: 70, 状態異常: "混乱" }),
      new 敵情報(2, "ｽﾗｲﾑ", 10, 0, 11, 0, 16, "002", 3, 2),
      new 敵情報(1, "ｵﾊﾞｹｶﾎﾞﾁｬ", 18, 0, 20, 18, 5, "038", 10, 10)
    ]);
    new クエスト情報("幽霊城", "stage2.gif", [
      [...アイテム.名前範囲("いばらのむち", "ﾙｰﾝｽﾀｯﾌ")],
      [...アイテム.名前範囲("皮の鎧", "青銅の鎧")],
      [
        undefined,
        ...new 連続("ﾊﾟﾃﾞｷｱの根っこ", 2),
        ...new 連続("魔法の聖水", 2),
        "守りの石", "魔法の鏡",
        ...アイテム.名前範囲("守りの石", "ﾓﾝｽﾀｰ銀貨"),
        "ﾄﾞﾗｺﾞﾝ草", "爆弾石",
        ...アイテム.名前範囲("銀のたてごと", "魔石のｶｹﾗ")
      ]
    ], [
      new 敵情報(undefined, "亡霊剣士", 1000, 45, 60, 20, 50, "500", 160, 50, "剣士", 10, { 命中率: 150, 一時的状態: "攻反撃" })
    ], [
      new 敵情報(4, "ｺﾞｰｽﾄ", 20, 0, 36, 20, 30, "035", 7, 4),
      new 敵情報(3, "ﾒｲｼﾞｺﾞｰｽﾄ", 26, 35, 32, 26, 36, "036", 12, 6, "魔法使い", 8),
      new 敵情報(3, "ｼｬﾄﾞｰ", 21, 33, 20, 35, 44, "046", 11, 5, "ﾄﾞﾗｺﾞﾝ", 10),
      new 敵情報(3, "ﾐｲﾗ男", 50, 37, 40, 6, 16, "040", 10, 7, "盗賊", 6),
      new 敵情報(3, "ｶﾞｲｺﾂ剣士", 45, 20, 50, 15, 20, "043", 12, 6, "剣士", 10),
      new 敵情報(3, "ﾅｲﾄｳｨｽﾌﾟ", 25, 45, 30, 25, 35, "070", 9, 5, "闇魔道士", 4),
      new 敵情報(2, "ﾁﾋﾞﾍﾞﾛｽ", 41, 0, 31, 8, 61, "203", 8, 4),
      new 敵情報(1, "ﾊﾟﾝﾌﾟｷﾝ", 65, 0, 55, 20, 14, "039", 16, 8),
      new 敵情報(1, "人食い箱", 120, 42, 55, 10, 200, "090", 30, 50, "眠り系", 30, { 一時的状態: "２倍" }),
    ]);
    new クエスト情報("海辺の洞窟", "stage3.gif", [
      [...アイテム.名前範囲("こんぼう", "どくばり")],
      [...アイテム.名前範囲("うろこの鎧", "ｿﾞﾝﾋﾞﾒｲﾙ")],
      [
        undefined,
        ...new 連続("ﾊﾟﾃﾞｷｱの根っこ", 2),
        ... new 連続("魔法の聖水", 2),
        ...アイテム.名前範囲("守りの石", "ﾓﾝｽﾀｰ銀貨"),
        "ﾄﾞﾗｺﾞﾝ草", "爆弾石", "身代わり人形",
        ...アイテム.名前範囲("銀のたてごと", "魔石のｶｹﾗ")
      ]
    ], [
      new 敵情報(undefined, "ｷﾗｰｼｪﾙ", 450, 50, 90, 90, 30, "215", 100, 150, "戦士", 30, { 命中率: 150, 一時的状態: "魔反撃" }),
      new 敵情報(undefined, "ﾃﾞﾋﾞﾙｼｪﾙ", 1000, 100, 60, 50, 30, "506", 120, 200, "僧侶", 12, { 命中率: 150, 一時的状態: "魔反撃" })
    ], [
      new 敵情報(1, "ﾎｲﾐｽﾗｲﾑ", 50, 45, 30, 15, 50, "010", 14, 5, "僧侶", 6),
      new 敵情報(1, "しびれｸﾗｹﾞ", 60, 31, 36, 18, 35, "012", 13, 6, "麻痺系", 20),
      new 敵情報(1, "ｽﾗｲﾑつむり", 40, 43, 20, 80, 20, "015", 16, 9, "ｽﾗｲﾑ", 7),
      new 敵情報(1, "ﾒｲｼﾞﾄﾞﾗｷｰ", 54, 59, 40, 20, 75, "026", 14, 6, "ｽﾗｲﾑ", 4),
      new 敵情報(1, "亀戦士", 48, 15, 64, 70, 5, "217", 13, 4, "戦士", 10, "無職", 30),
      new 敵情報(1, "ﾁﾋﾞｲｴﾃｨ", 64, 0, 46, 15, 80, "200", 7, 3),
      new 敵情報(1, "ｲｴﾃｨ", 150, 24, 78, 25, 22, "201", 20, 8, "羊飼い", 10, { 状態異常: "眠り" })
    ]);
    new クエスト情報("地獄の砂浜", "stage4.gif", [
      [...アイテム.名前範囲("いばらのむち", "ｿﾞﾝﾋﾞｷﾗｰ")],
      [...アイテム.名前範囲("毛皮のﾏﾝﾄ", "ﾃﾞﾋﾞﾙｱｰﾏｰ")],
      [
        undefined, "上薬草",
        ... new 連続("特薬草", 2),
        ...アイテム.名前範囲("守りの石", "ﾓﾝｽﾀｰ金貨"),
        "身代わり人形", "身代わり石像",
        ...アイテム.名前範囲("銀のたてごと", "魔石のｶｹﾗ")
      ]
    ], [
      new 敵情報(undefined, "ｺﾞｰﾚﾑ", 1500, 77, 100, 60, 50, "546", 150, 100, "風水士", 10, "無職", 20, { 命中率: 150, 一時的状態: "攻軽減" }),
    ], [
      new 敵情報(3, "ﾏｯﾄﾞﾊﾝﾄﾞ", 70, 50, 85, 36, 50, "063", 10, 8, "召喚系", 10),
      new 敵情報(3, "おおさそり", 34, 19, 76, 130, 45, "052", 11, 9, "麻痺系", 10, "無職", 30),
      new 敵情報(2, "ﾎﾞﾑ", 50, 42, 50, 60, 50, "071", 15, 10, "悪魔", 10),
      new 敵情報(1, "まどうし", 55, 66, 35, 30, 70, "060", 16, 6, "ｽﾗｲﾑ", 3),
      new 敵情報(2, "ｻﾎﾞﾃﾝﾀﾞｰ", 100, 50, 70, 50, 150, "058", 20, 5, "踊り子", 16),
      new 敵情報(2, "ｱｶﾃﾝﾀﾞｰ", 100, 50, 70, 50, 150, "059", 20, 5, "踊り子", 16),
      new 敵情報(2, "ﾄｹﾞﾎﾞｳｽﾞ", 64, 24, 55, 125, 15, "212", 23, 7, "ﾊﾞｰｻｰｶｰ", 10),
      new 敵情報(2, "ﾁﾋﾞﾍﾞﾘｰ", 50, 16, 55, 15, 120, "198", 15, 5, "魔物使い", 5, "無職"),
      new 敵情報(1, "ﾍﾞﾛﾛﾝ", 120, 34, 85, 40, 10, "199", 28, 10, "魔物使い", 50),
      new 敵情報(1, "ﾁﾋﾞﾄﾞﾗｺﾞﾝ", 150, 14, 85, 35, 20, "083", 24, 7, "魔物使い", 5)
    ]);
    new クエスト情報("魔術師の塔", "stage5.gif", [
      [...アイテム.名前範囲("銅の剣", "ﾊﾞﾄﾙｱｯｸｽ")],
      [...アイテム.名前範囲("うろこの鎧", "鋼鉄の鎧")],
      [
        undefined, "特薬草", "賢者の石",
        ...アイテム.名前範囲("魔法の鏡", "ﾓﾝｽﾀｰ金貨"),
        "ﾄﾞﾗｺﾞﾝ草", "爆弾石",
        new 連続("へんげの杖", 3),
        ...アイテム.名前範囲("身代わり人形", "不思議なﾀﾝﾊﾞﾘﾝ")
      ]
    ], [
      new 敵情報(undefined, "闇の魔術士", 1400, 250, 70, 20, 100, "510", 180, 120, "ﾊｸﾞﾚﾒﾀﾙ", 25, { 命中率: 150, 一時的状態: "魔軽減" }),
      new 敵情報(undefined, "魔法使い", 144, 72, 50, 45, 76, "061", 24, 9, "魔法使い", 14),
      new 敵情報(undefined, "ｽﾗｲﾑまどう", 160, 84, 45, 30, 100, "013", 26, 8, "闇魔道士", 16)
    ], [
      new 敵情報(5, "まどうし", 55, 66, 45, 40, 70, "060", 18, 6, "ｽﾗｲﾑ", 3),
      new 敵情報(4, "魔法使い", 67, 90, 40, 45, 76, "061", 20, 9, "魔法使い", 14),
      new 敵情報(4, "ｽﾗｲﾑまどう", 70, 104, 35, 30, 100, "013", 19, 8, "闇魔道士", 16),
      new 敵情報(3, "ﾃﾞﾋﾞﾙｴｯｸﾞ", 66, 66, 66, 66, 66, "065", 1, 6, "商人", 10, "無職", 30),
      new 敵情報(3, "ﾐﾆﾃﾞｰﾓﾝ", 124, 16, 64, 35, 110, "066", 15, 6, "遊び人", 26),
      new 敵情報(3, "おおめだま", 90, 34, 78, 55, 60, "077", 21, 8, "闇魔道士", 16),
      new 敵情報(3, "ｽﾍﾟｸﾃｯﾄﾞ", 100, 44, 65, 50, 64, "078", 20, 11, "結界士", 50),
      new 敵情報(1, "ﾋﾞｯｸﾞﾄﾞﾗｷｰ", 180, 24, 98, 10, 180, "258", 40, 8, "結界士", 30, { 状態異常: "混乱" }),
      new 敵情報(1, "ﾐﾐｯｸ", 300, 68, 100, 30, 300, "091", 50, 100, "即死系", 10, { 一時的状態: "２倍" }),
      new 敵情報(1, "ﾒﾀﾙｽﾗｲﾑ", 8, 31, 40, 1500, 1500, "004", 250, 10, "ｽﾗｲﾑ", 3, "にげだす", 0, { 一時的状態: "魔無効" })
    ]);
    new クエスト情報("荒野の獣道", "stage6.gif", [
      [...アイテム.名前範囲("おおきづち", "ｸｻﾅｷﾞの剣")],
      [...アイテム.名前範囲("旅人の服", "鉄の鎧")],
      [
        ...アイテム.名前範囲("命の木の実", "ﾓﾝｽﾀｰ金貨"),
        "へんげの杖",
        ...アイテム.名前範囲("身代わり人形", "不思議なﾀﾝﾊﾞﾘﾝ")
      ]
    ], [
      new 敵情報(undefined, "ｷﾞｶﾞﾝﾃｽ", 2500, 60, 200, 20, 20, "563", 200, 5, "ﾊﾞｰｻｰｶｰ", 60, "無職", 20, { 命中率: 150, 状態異常: "眠り", 一時的状態: "眠り" })
    ], [
      new 敵情報(4, "ﾏｰｼﾞﾏﾀﾝｺﾞ", 80, 39, 65, 65, 80, "032", 23, 18, "猛毒系", 999),
      new 敵情報(4, "ｷﾝｸﾞｺﾌﾞﾗ", 100, 0, 85, 35, 60, "054", 21, 8, undefined, undefined, "無職", 20),
      new 敵情報(3, "ﾚｯﾄﾞｱｲ", 80, 61, 50, 30, 40, "074", 24, 10, "ｱｻｼﾝ", 15),
      new 敵情報(4, "ﾀﾞｰｸｱｲ", 70, 71, 60, 30, 50, "075", 28, 11, "ｱｻｼﾝ", 16),
      new 敵情報(4, "ﾓﾋｶﾝﾄ", 160, 22, 120, 50, 35, "210", 27, 14, "羊飼い", 10, "無職", 20, { 状態異常: "眠り" }),
      new 敵情報(3, "ﾍﾞﾋﾞｰﾊﾟﾝｻｰ", 90, 0, 75, 25, 125, "206", 18, 12, undefined, undefined, "無職", 20),
      new 敵情報(2, "ｷﾗｰﾊﾟﾝｻｰ", 130, 19, 105, 30, 74, "207", 30, 10, "ﾊﾞｰｻｰｶｰ", 20, "無職", 20),
      new 敵情報(2, "ﾆｮﾛﾛ", 75, 34, 96, 20, 80, "229", 28, 26, "結界士", 5, { 命中率: 70 }),
      new 敵情報(2, "ﾗﾌﾚｼｱ", 95, 44, 86, 27, 40, "230", 30, 26, "悪魔", 26),
      new 敵情報(2, "ﾓｻﾓｻ", 100, 59, 60, 40, 70, "512", 15, 100, "ﾓｰｸﾞﾘ", 100),
      new 敵情報(2, "ﾃﾞｽﾛｰﾊﾟｰ", 80, 20, 90, 80, 60, "514", 32, 16, "ﾊﾞﾝﾊﾟｲｱ", 20),
      new 敵情報(1, "ｻﾝﾀﾞｰｼｰﾌﾟ", 150, 50, 70, 50, 20, "513", 50, 50, "勇者", 30, "無職", 30)
    ]);
    new クエスト情報("マグマ山", "stage7.gif", [
      [...アイテム.名前範囲("鎖がま", "ｸｻﾅｷﾞの剣")],
      [...アイテム.名前範囲("ｽﾗｲﾑの服", "魔法の法衣")],
      [
        ...アイテム.名前範囲("魔法の鏡", "ﾓﾝｽﾀｰ金貨"),
        ...アイテム.名前範囲("身代わり人形", "不思議なﾀﾝﾊﾞﾘﾝ")
      ]
    ], [
      new 敵情報(undefined, "ﾎﾞﾑA", 100, 42, 80, 80, 80, "071", 55, 30, "悪魔", 10, "無職", 20),
      new 敵情報(undefined, "ひくいどり", 1800, 97, 160, 70, 80, "530", 300, 180, "忍者", 15, "風水士", 10, { 一時的状態: "魔軽減", 命中率: 150 }),
      new 敵情報(undefined, "ﾎﾞﾑB", 100, 42, 80, 80, 80, "071", 55, 30, "悪魔", 10, "無職", 20)
    ], [
      new 敵情報(1, "ﾌｧｲｱｰｽﾗｲﾑ", 100, 100, 77, 58, 82, "008", 25, 12, "魔法使い", 16),
      new 敵情報(1, "ﾏｸﾞﾏｽﾗｲﾑ", 130, 0, 93, 70, 30, "021", 30, 27, undefined, undefined, "無職", 30),
      new 敵情報(1, "爆弾岩", 100, 42, 86, 40, 10, "080", 50, 15, "自爆系", 20),
      new 敵情報(1, "ﾁｸﾘ", 111, 26, 111, 75, 20, "211", 34, 25, "ﾊﾞｰｻｰｶｰ", 10, undefined, 30),
      new 敵情報(1, "ﾎﾞﾑ", 70, 42, 60, 80, 60, "071", 35, 20, "悪魔", 10, undefined, 20),
      new 敵情報(1, "ﾁﾋﾞﾄﾞﾗｺﾞﾝ", 120, 26, 78, 65, 66, "083", 30, 12, "魔物使い", 5),
      new 敵情報(1, "ﾌﾞﾗｯｸﾄﾞﾗｺ", 110, 17, 90, 100, 50, "084", 32, 20, "忍者", 5),
      new 敵情報(1, "ﾄﾞﾗｺﾞﾝ", 200, 21, 140, 75, 68, "224", 60, 24, "忍者", 15),
      new 敵情報(1, "ﾁﾋﾞｴｯｸﾞ", 80, 60, 70, 80, 100, "114", 20, 14, "ﾓｰｸﾞﾘ", 100),
      new 敵情報(1, "ﾐﾆﾀｳﾙｽ", 140, 20, 112, 50, 90, "115", 26, 18, "ﾓｰｸﾞﾘ", 10, "無職", 30),
      new 敵情報(1, "炎の戦士", 110, 27, 152, 30, 60, "576", 28, 10, "忍者", 5, "無職", 20)
    ]);
    new クエスト情報("妖精の森", "stage8.gif", [
      [...アイテム.名前範囲("聖なるﾅｲﾌ", "ﾓｰﾆﾝｸﾞｽﾀｰ")],
      [...アイテム.名前範囲("青銅の鎧", "ｿﾞﾝﾋﾞﾒｲﾙ")],
      [
        ...アイテム.名前範囲("魔法の鏡", "ﾓﾝｽﾀｰ金貨"),
        ...アイテム.名前範囲("魔法の鏡", "ﾓﾝｽﾀｰ金貨"),
        "ﾏﾈﾏﾈの心",
        ...アイテム.名前範囲("身代わり人形", "不思議なﾀﾝﾊﾞﾘﾝ")
      ]
    ], [
      new 敵情報(undefined, "ﾍﾞﾋｰﾓｽ", 2800, 299, 185, 125, 145, "553", 350, 200, "竜騎士", 30, "ﾓﾝｸ", 5, { 命中率: 150, 一時的状態: "大防御" })
    ], [
      new 敵情報(3, "ｺﾛﾋｰﾛｰ", 100, 21, 80, 60, 60, "100", 30, 15, "勇者", 10, "無職", 20, { 命中率: 70 }),
      new 敵情報(3, "ｺﾛﾌｧｲﾀｰ", 120, 11, 90, 70, 10, "101", 30, 15, "戦士", 30, "無職", 20, { 命中率: 70 }),
      new 敵情報(3, "ｺﾛﾏｰｼﾞ", 80, 61, 50, 30, 80, "102", 30, 15, "魔法使い", 14, { 命中率: 70 }),
      new 敵情報(3, "ｺﾛﾌﾟﾘｰｽﾄ", 90, 51, 60, 40, 60, "103", 30, 15, "僧侶", 6, { 命中率: 70 }),
      new 敵情報(1, "爆弾岩", 100, 42, 86, 40, 10, "080", 40, 5, "自爆系", 20),
      new 敵情報(1, "ﾒｶﾞｻﾞﾙﾛｯｸ", 110, 42, 75, 50, 44, "081", 36, 10, "騎士", 80, "無職", 30),
      new 敵情報(2, "ﾏﾈﾏﾈ", 133, 99, 99, 33, 99, "068", 33, 33, "ものまね士", 999),
      new 敵情報(1, "ｲﾀｽﾞﾗ妖精", 140, 50, 100, 40, 120, "110", 27, 20, "遊び人", 999, "妖精", 999),
      new 敵情報(1, "ｷﾞｬﾝﾌﾞﾙ妖精", 104, 20, 120, 40, 130, "111", 28, 22, "ものまね士", 50, "妖精", 999),
      new 敵情報(1, "ﾏｳｻｷﾞ", 104, 20, 120, 40, 130, "260", 28, 22, "遊び人", 999, "ものまね士", 80)
    ]);
    new クエスト情報("スライムランド", "stage9.gif", [
      [...アイテム.名前範囲("聖なるﾅｲﾌ", "ｸｻﾅｷﾞの剣")],
      [...アイテム.名前範囲("青銅の鎧", "忍びの服")],
      [
        ...アイテム.名前範囲("魔法の鏡", "ﾓﾝｽﾀｰ金貨"),
        ...アイテム.名前範囲("魔法の鏡", "ﾓﾝｽﾀｰ金貨"),
        "ｽﾗｲﾑの心",
        ...アイテム.名前範囲("身代わり人形", "不思議なﾀﾝﾊﾞﾘﾝ")
      ]
    ], [
      new 敵情報(undefined, "ｽﾗｲﾑA", 150, 91, 120, 20, 100, "002", 30, 10, "時魔道士", 20),
      new 敵情報(undefined, "ｽﾗｲﾑB", 150, 91, 120, 20, 100, "002", 30, 10, "黒魔道士", 80),
      new 敵情報(undefined, "ｷﾝｸﾞｽﾗｲﾑ", 3000, 400, 200, 150, 120, "516", 500, 400, "ﾊﾞｰｻｰｶｰ", 5, "無職", 20, { 命中率: 150, 一時的状態: "攻無効" }),
      new 敵情報(undefined, "ｽﾗｲﾑC", 150, 91, 120, 20, 100, "002", 30, 10, "白魔道士", 70),
      new 敵情報(undefined, "ｽﾗｲﾑD", 150, 91, 120, 20, 100, "002", 30, 10, "赤魔道士", 90)
    ], [
      new 敵情報(3, "ﾌﾞﾁｽﾗｲﾑ", 77, 0, 77, 77, 77, "001", 22, 22),
      new 敵情報(8, "ｽﾗｲﾑ", 90, 30, 90, 40, 90, "002", 25, 20, "ｽﾗｲﾑﾗｲﾀﾞｰ", 10),
      new 敵情報(4, "ｽﾗｲﾑﾍﾞｽ", 100, 0, 105, 30, 100, "003", 28, 24, undefined, undefined, "無職", 20),
      new 敵情報(4, "ﾊﾞﾌﾞﾙｽﾗｲﾑ", 140, 32, 120, 50, 70, "020", 35, 10, "猛毒系", 20),
      new 敵情報(4, "ﾎｲﾐｽﾗｲﾑ", 100, 45, 90, 30, 100, "010", 30, 15, "僧侶", 6),
      new 敵情報(4, "しびれｸﾗｹﾞ", 120, 31, 126, 42, 65, "012", 36, 11, "麻痺系"),
      new 敵情報(3, "ｽﾗｲﾑまどう", 110, 84, 85, 30, 100, "013", 34, 21, "闇魔道士", 16),
      new 敵情報(3, "ｽﾗｲﾑつむり", 60, 43, 90, 130, 40, "015", 32, 27, "ｽﾗｲﾑ", 7),
      new 敵情報(3, "ﾌｧｲｱｰｽﾗｲﾑ", 125, 15, 125, 85, 75, "008", 40, 25, "魔物使い", 5),
      new 敵情報(3, "ｽﾗｲﾑﾊﾞｯﾄ", 100, 44, 115, 20, 155, "027", 41, 11, "ﾊﾞﾝﾊﾟｲｱ", 20),
      new 敵情報(2, "ﾍﾞﾎﾏｽﾗｲﾑ", 150, 99, 90, 30, 120, "011", 40, 30, "僧侶", 999),
      new 敵情報(2, "ﾏｸﾞﾏｽﾗｲﾑ", 90, 10, 148, 140, 50, "021", 38, 31, "商人", 3),
      new 敵情報(1, "ﾋﾞｯｸｽﾗｲﾑ", 300, 0, 145, 10, 40, "006", 40, 30),
      new 敵情報(1, "ｽﾗｲﾑﾌｧﾗｵ", 444, 144, 144, 144, 144, "234", 144, 144),
      new 敵情報(1, "ﾒﾀﾙｽﾗｲﾑ", 8, 31, 70, 2500, 2600, "004", 250, 10, "ｽﾗｲﾑ", 3, "逃げ出す", 0, { 一時的状態: "魔無効" }),
      new 敵情報(1, "ﾊｸﾞﾚﾒﾀﾙ", 14, 61, 110, 4000, 2000, "022", 1500, 30, "ﾊｸﾞﾚﾒﾀﾙ", 25, "逃げ出す", 0, { 一時的状態: "魔無効" })
    ]);
    new クエスト情報("死霊の沼地", "stage10.gif", [
      [...アイテム.名前範囲("鋼鉄の剣", "ﾋﾞｯｸﾞﾎﾞｳｶﾞﾝ")],
      [...アイテム.名前範囲("さまよう鎧", "銀の胸当て")],
      [
        ...アイテム.名前範囲("命の木の実", "ﾓﾝｽﾀｰ金貨"),
        ...アイテム.名前範囲("命の木の実", "ﾓﾝｽﾀｰ金貨"),
        "精霊の守り", "伯爵の血",
        ...アイテム.名前範囲("身代わり人形", "不思議なﾀﾝﾊﾞﾘﾝ")
      ]
    ], [
      new 敵情報(undefined, "死霊A", 299, 42, 119, 199, 66, "072", 63, 13, "青魔道士", 60),
      new 敵情報(undefined, "死霊の騎士", 5500, 999, 260, 180, 180, "566", 666, 444, "魔剣士", 70, "剣士", 999, { 命中率: 200, 最大ＭＰ: 5000, 一時的状態: "受流し" }),
      new 敵情報(undefined, "死霊B", 299, 42, 119, 199, 66, "072", 63, 13, "青魔道士", 60),
    ], [
      new 敵情報(1, "ﾌﾞﾗｯﾄﾞﾊﾝﾄﾞ", 160, 41, 130, 50, 60, "064", 41, 10, "盗賊", 10, "ﾈｸﾛﾏﾝｻｰ", 10),
      new 敵情報(1, "ﾏﾐｰ", 170, 0, 150, 60, 60, "041", 43, 16, undefined, undefined, "無職", 20),
      new 敵情報(1, "ｽｶﾙﾍｯﾄﾞ", 90, 96, 90, 180, 60, "056", 44, 20, "忍者", 60),
      new 敵情報(1, "影の騎士", 200, 16, 170, 30, 64, "044", 43, 25, "魔剣士", 30),
      new 敵情報(1, "ｼｬﾄﾞｰ", 94, 44, 90, 185, 144, "046", 41, 20, "ﾄﾞﾗｺﾞﾝ", 30),
      new 敵情報(1, "あやしい影", 98, 44, 110, 190, 144, "047", 43, 30, "即死系", 30),
      new 敵情報(1, "ｽﾗｲﾑﾊﾞｯﾄ", 140, 54, 145, 60, 185, "027", 40, 15, "ﾊﾞﾝﾊﾟｲｱ", 20),
      new 敵情報(1, "死霊", 199, 42, 119, 199, 66, "072", 45, 13, "青魔道士", 60),
      new 敵情報(1, "ﾊﾞﾌﾞﾙﾎﾟｲｽﾞﾝ", 180, 92, 160, 80, 60, "237", 39, 21, "猛毒系", 20),
      new 敵情報(1, "ﾃﾞﾋﾞﾙｷｬｯﾄ", 160, 32, 140, 80, 160, "231", 41, 22, "ﾊｸﾞﾚﾒﾀﾙ", 25),
      new 敵情報(1, "ｷﾘﾏ", 200, 62, 100, 10, 200, "528", 50, 10, "光魔道士", 110)
    ]);
    new クエスト情報("ドラゴンの谷", "stage11.gif", [
      [...アイテム.名前範囲("ｿﾞﾝﾋﾞｷﾗｰ", "ﾄﾞﾗｺﾞﾝｷﾗｰ")],
      [...アイテム.名前範囲("ｿﾞﾝﾋﾞﾒｲﾙ", "水の羽衣")],
      [
        ...アイテム.名前範囲("命の木の実", "ﾓﾝｽﾀｰ金貨"),
        "賢者の悟り", "ﾄﾞﾗｺﾞﾝの心",
        ...アイテム.名前範囲("身代わり人形", "不思議なﾀﾝﾊﾞﾘﾝ")
      ]
    ], [
      new 敵情報(undefined, "竜王", 8000, 3000, 300, 240, 100, "560", 999, 500, "ﾄﾞﾗｺﾞﾝ", 999, "ﾓﾝｸ", 1999, { 命中率: 200, 最大ＭＰ: 8000, 一時的状態: "息反撃" }),
      new 敵情報(undefined, "ﾌﾞﾙｰｽﾄｰﾝ", 15, 999, 200, 5000, 1000, "191", 70, 500, "賢者", 130, "青魔道士", 999, { 一時的状態: "魔無効" })
    ], [
      new 敵情報(2, "ﾌﾟﾁﾋｰﾛｰ", 220, 61, 140, 120, 110, "105", 50, 20, "勇者", 60, "無職", 20),
      new 敵情報(2, "ﾌﾟﾁﾌｧｲﾀｰ", 250, 41, 170, 150, 20, "106", 50, 20, "戦士", 999, "無職", 20),
      new 敵情報(2, "ﾌﾟﾁﾏｰｼﾞ", 160, 191, 100, 60, 150, "107", 50, 20, "魔法使い", 60),
      new 敵情報(2, "ﾌﾟﾁﾌﾟﾘｰｽﾄ", 170, 181, 120, 80, 90, "108", 50, 20, "僧侶", 55),
      new 敵情報(1, "ﾌﾞﾙｰﾄﾞﾗｺﾞﾝ", 150, 98, 155, 80, 120, "226", 51, 15, "ﾄﾞﾗｺﾞﾝ", 90),
      new 敵情報(1, "ﾊｸﾘｭｳ", 200, 69, 160, 90, 180, "232", 60, 20, "忍者", 60),
      new 敵情報(1, "ｻﾗﾏﾝﾀﾞｰ", 280, 79, 170, 150, 110, "533", 63, 24, "忍者", 60),
      new 敵情報(1, "ﾄﾞﾗｺﾞﾝﾏｯﾄ", 300, 99, 200, 170, 50, "556", 66, 20, "ﾄﾞﾗｺﾞﾝ", 100),
      new 敵情報(1, "ﾃﾞﾝﾃﾞﾝﾘｭｳ", 340, 99, 210, 180, 120, "550", 68, 22, "ﾄﾞﾗｺﾞﾝ", 30, "忍者", 15)
    ]);
    new クエスト情報("暗黒魔城", "stage12.gif", [
      [
        ...アイテム.名前範囲("妖精の剣", "諸刃の剣"),
        ...アイテム.名前範囲("ｶﾞｲｱの剣", "魔人の斧")
      ],
      [
        ...アイテム.名前範囲("天使のﾛｰﾌﾞ", "地獄の鎧"),
        ...アイテム.名前範囲("ﾄﾞﾗｺﾞﾝﾛｰﾌﾞ", "魔人の鎧")
      ],
      [
        ...アイテム.名前範囲("賢者の石", "世界樹の葉"),
        ...アイテム.名前範囲("祈りの指輪"),
        ...アイテム.名前範囲("ｽｷﾙの種", "小さなﾒﾀﾞﾙ"),
        new 連続("勇者の証", 2),
        new 連続("邪神像", 2),
        "ｼﾞｪﾉﾊﾞ細胞",
        ...アイテム.名前範囲("身代わり人形", "不思議なﾀﾝﾊﾞﾘﾝ")
      ]
    ], [
      new 敵情報(undefined, "ﾊﾟｰﾌﾟﾙｽﾄｰﾝ", 20, 999, 250, 6000, 2000, "194", 100, 500, "猛毒系", 999, "眠り系", 999, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "魔王", 14000, 4000, 320, 300, 140, "700", 2000, 1500, "魔王", 999, "暗黒騎士", 999, { 命中率: 250, 最大ＭＰ: 10000, 一時的状態: "攻反撃" }),
      new 敵情報(undefined, "ﾚｯﾄﾞｽﾄｰﾝ", 20, 999, 250, 6000, 2000, "190", 100, 500, "忍者", 999, "魔法使い", 999, { 一時的状態: "魔無効" })
    ], [
      new 敵情報(4, "ﾋﾞｯｸﾞｱｲ", 180, 64, 180, 100, 180, "526", 70, 35, "悪魔", 26, "無職", 30),
      new 敵情報(5, "ﾁﾋﾞﾍﾞﾛｽ", 150, 0, 160, 80, 200, "203", 45, 15, "無職", 20),
      new 敵情報(4, "ｹﾙﾍﾞﾛｽ", 270, 33, 220, 130, 50, "204", 60, 60, "時魔道士", 20, "無職", 20),
      new 敵情報(4, "闇の剣士", 230, 64, 215, 120, 125, "220", 74, 50, "剣士", 80, "無職", 20),
      new 敵情報(4, "黒の騎士", 255, 54, 185, 155, 35, "222", 75, 40, "戦士", 70, "無職", 30),
      new 敵情報(4, "ｽｶﾙｷﾝｸﾞ", 210, 48, 180, 110, 110, "567", 70, 40, "ﾊﾞﾝﾊﾟｲｱ", 50),
      new 敵情報(2, "ﾊﾞﾝﾊﾟｲｱ", 280, 44, 200, 120, 150, "568", 76, 50, "ﾊﾞﾝﾊﾟｲｱ", 999, "無職", 20),
      new 敵情報(2, "ﾐﾗｰﾅｲﾄ", 200, 94, 200, 180, 180, "520", 70, 70, "ものまね士", 999),
      new 敵情報(2, "ﾃﾞﾋﾞﾙｱｲ", 180, 64, 220, 120, 200, "539", 62, 20, "ｱｻｼﾝ", 30,),
      new 敵情報(1, "ﾊﾟﾝﾄﾞﾗﾎﾞｯｸｽ", 900, 69, 300, 95, 800, "092", 100, 500, "即死系", 20, { 一時的状態: "２倍" }),
      new 敵情報(1, "ﾊｸﾞﾚﾒﾀﾙ", 14, 91, 110, 4000, 2000, "022", 1500, 30, "ﾊｸﾞﾚﾒﾀﾙ", 25, "逃げ出す", 0)
    ]);
    new クエスト情報("死の大地", "stage13.gif", [
      [
        ...アイテム.名前範囲("妖精の剣", "諸刃の剣"),
        ...アイテム.名前範囲("ｶﾞｲｱの剣", "魔人の斧")
      ],
      [
        ...アイテム.名前範囲("天使のﾛｰﾌﾞ", "地獄の鎧"),
        ...アイテム.名前範囲("ﾄﾞﾗｺﾞﾝﾛｰﾌﾞ", "魔人の鎧")
      ],
      [
        ...アイテム.名前範囲("賢者の石", "世界樹の葉"),
        "祈りの指輪", "ｽｷﾙの種", "幸せの種",
        ...new 連続("小さなﾒﾀﾞﾙ", 2),
        "勇者の証", "邪神像", "闇のﾛｻﾞﾘｵ", "ｷﾞｬﾝﾌﾞﾙﾊｰﾄ", "ｼﾞｪﾉﾊﾞ細胞", "時の砂", "ｲﾝﾃﾘﾒｶﾞﾈ"
      ]
    ], [
      new 敵情報(undefined, "ﾌﾞﾗｯｸｽﾄｰﾝ", 20, 999, 250, 6000, 2000, "195", 100, 800, "闇魔道士", 999, "悪魔", 999, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "死神", 12000, 5000, 360, 180, 240, "702", 2000, 1500, "闇魔道士", 70, "ｷﾞｬﾝﾌﾞﾗｰ", 999, { 命中率: 250, 一時的状態: "魔反撃", 最大ＭＰ: 14000 }),
      new 敵情報(undefined, "ﾌﾞﾙｰｽﾄｰﾝ", 20, 999, 250, 6000, 2000, "191", 100, 800, "賢者", 130, "青魔道士", 999, { 一時的状態: "魔無効" })
    ], [
      new 敵情報(1, "竜魔人", 450, 85, 270, 200, 50, "523", 85, 70, "竜騎士", 50, "無職", 20),
      new 敵情報(1, "ﾃﾞｽｻｲｽﾞ", 250, 139, 230, 80, 200, "543", 86, 142, "即死系", 10),
      new 敵情報(1, "魔王の影", 200, 120, 220, 300, 150, "527", 80, 75, "魔王", 50),
      new 敵情報(1, "ｷﾗｰﾏｼﾝ", 444, 111, 244, 144, 114, "521", 88, 88, "魔剣士", 50, "弓使い", 90),
      new 敵情報(1, "ﾍﾞﾋｰﾓｽ", 415, 97, 265, 85, 145, "553", 90, 40, "竜騎士", 30, "ﾓﾝｸ", 5),
      new 敵情報(1, "ｷﾞｶﾞﾝﾃｽ", 600, 59, 400, 50, 10, "563", 100, 5, "ﾊﾞｰｻｰｶｰ", 999, "無職", 20, { 命中率: 70, 一時的状態: "２倍", 状態異常: "眠り", テンション: 20 }),
      new 敵情報(1, "ﾉﾛｲ", 380, 59, 200, 160, 180, "542", 82, 65, "ｷﾞｬﾝﾌﾞﾗｰ", 80, "無職", 20),
      new 敵情報(1, "ﾔﾐ", 410, 69, 280, 150, 120, "536", 88, 64, "ｿﾙｼﾞｬｰ", 140, "無職", 20),
      new 敵情報(1, "ﾊﾞｼﾞﾘｽｸ", 400, 67, 300, 40, 280, "558", 90, 80, "蟲師", 999, "無職", 20)
    ]);
    new クエスト情報("魔界", "stage14.gif", [
      [
        ...アイテム.名前範囲("ﾄﾞﾗｺﾞﾝﾃｲﾙ", "諸刃の剣"),
        ...アイテム.名前範囲("正義のｿﾛﾊﾞﾝ", "魔人の斧"),
        "破壊の鉄球"
      ], [
        ...アイテム.名前範囲("光の鎧", "王者のﾏﾝﾄ")
      ], [
        ...アイテム.名前範囲("賢者の石", "世界樹の葉"),
        "ｴﾙﾌの飲み薬", "勇者の証", "邪神像", "ｷﾞｻﾞｰﾙの野菜", "ｸﾎﾟの実",
        new 連続("ｼﾞｪﾉﾊﾞ細胞", 2),
        ...アイテム.名前範囲("天馬のたづな", "ﾊﾟｰﾌﾟﾙｵｰﾌﾞ"),
        "時の砂",
        ...アイテム.名前範囲("復活の草", "宝物庫の鍵")
      ]
    ], [
      new 敵情報(undefined, "ｲﾋﾞﾙｻﾝﾀﾞｰA", 5000, 999, 400, 300, 3000, "696", 300, 300, "結界士", 999, "ｴﾙﾌ", 999, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "ｻﾀﾝ", 15000, 8000, 600, 300, 250, "800", 3000, 3000, "ｿﾙｼﾞｬｰ", 999, "堕天使", 999, { 命中率: 400, 最大ＭＰ: 30000 }),
      new 敵情報(undefined, "ｲﾋﾞﾙｻﾝﾀﾞｰB", 5000, 999, 400, 300, 3000, "696", 300, 300, "魔王", 999, "召喚士", 999, { 一時的状態: "魔無効" })
    ], [
      new 敵情報(6, "ﾃﾞｽﾏｼﾝ", 555, 222, 333, 222, 222, "522", 111, 111, "魔剣士", 999, "弓使い", 999),
      new 敵情報(5, "ｷﾝｸﾞﾍﾞﾋｰﾓｽ", 600, 149, 350, 180, 160, "554", 120, 100, "ﾊﾞｰｻｰｶｰ", 40, "無職", 20),
      new 敵情報(5, "ｲｸﾛﾌﾟｽ", 700, 99, 500, 50, 50, "564", 150, 10, "戦士", 999, "ﾊﾞｰｻｰｶｰ", 20),
      new 敵情報(5, "ﾀﾞｰｽﾄﾞﾗｺﾞﾝ", 500, 149, 300, 240, 200, "534", 125, 95, "ﾄﾞﾗｺﾞﾝ", 999, "無職", 20),
      new 敵情報(5, "ｽﾄｰﾝｺﾞｰﾚﾑ", 300, 155, 280, 400, 100, "547", 100, 200, "騎士", 60, "無職", 30),
      new 敵情報(4, "ﾗﾎﾞｽ", 420, 299, 270, 320, 120, "540", 90, 400, "時魔道士", 999, "即死系", 20),
      new 敵情報(4, "ｻｲｸﾙ", 350, 149, 280, 100, 30, "235", 115, 125, "堕天使", 160, "ｷﾞｬﾝﾌﾞﾗｰ", 999),
      new 敵情報(2, "ﾄﾞﾗｺﾞﾝｿﾞﾝﾋﾞ", 650, 92, 350, 260, 100, "557", 155, 100, "ﾀﾞｰｸｴﾙﾌ", 999, "魔人", 999, { 一時的状態: "復活" }),
      new 敵情報(1, "ﾀﾞｲｼﾞｬ", 760, 292, 460, 160, 260, "559", 255, 300, "蟲師", 999, "堕天使", 40, { 一時的状態: "復活" }),
      new 敵情報(1, "ﾒﾀﾙｷﾝｸﾞ", 25, 249, 200, 6000, 2000, "517", 4000, 100, "ﾊｸﾞﾚﾒﾀﾙ", 999, "逃げ出す", 0, { 一時的状態: "魔無効" })
    ]);
    new クエスト情報("鏡の世界", "stage15.gif", [
      [...アイテム.名前範囲("ｿﾞﾝﾋﾞｷﾗｰ", "破壊の鉄球")],
      [...アイテム.名前範囲("ｽﾗｲﾑｱｰﾏｰ", "王者のﾏﾝﾄ")],
      [
        "ｴﾙﾌの飲み薬",
        ...アイテム.名前範囲("賢者の悟り", "ｼﾞｪﾉﾊﾞ細胞"),
        "妖精の笛", "悪魔のしっぽ",
        ...アイテム.名前範囲("魔銃", "ﾋｰﾛｰｿｰﾄﾞ2"),
        "ﾁｮｺﾎﾞの羽", "ｲﾝﾃﾘﾒｶﾞﾈ"
      ]
    ]); // TODO 依存
    new クエスト情報("マダムガーデン", "stage16.gif", [
      [...アイテム.名前範囲("ｿﾞﾝﾋﾞｷﾗｰ", "ﾃﾞｰﾓﾝｽﾋﾟｱ")],
      [...アイテム.名前範囲("ｽﾗｲﾑｱｰﾏｰ", "ﾌﾞﾗｯﾄﾞﾒｲﾙ")],
      [
        ...アイテム.名前範囲("命の木の実", "ﾓﾝｽﾀｰ金貨"),
        ...アイテム.名前範囲("命の木の実", "ﾓﾝｽﾀｰ金貨"),
        "賢者の悟り", "ﾄﾞﾗｺﾞﾝの心", "ﾌｧｲﾄ一発", "ｴｯﾁな本",
        ...アイテム.名前範囲("妖精の笛", "時の砂"),
        "ｲﾝﾃﾘﾒｶﾞﾈ"
      ]
    ], [
      new 敵情報(undefined, "ﾒﾀﾙｷﾝｸﾞA", 25, 299, 200, 8000, 2000, "517", 4000, 100, "ﾊｸﾞﾚﾒﾀﾙ", 999, "逃げ出す", 0, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "ｺﾞｰﾙﾃﾞﾝｽﾗｲﾑ", 10, 399, 300, 15000, 8000, "590", 5000, 10000, "ﾊｸﾞﾚﾒﾀﾙ", 999, "逃げ出す", 0, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "ﾒﾀﾙｷﾝｸﾞB", 25, 299, 200, 8000, 2000, "517", 4000, 100, "ﾊｸﾞﾚﾒﾀﾙ", 999, "逃げ出す", 0, { 一時的状態: "魔無効" })
    ], [
      new 敵情報(4, "ﾒﾀﾙｽﾗｲﾑ", 8, 31, 70, 2500, 1500, "004", 250, 10, "ｽﾗｲﾑ", 3, "逃げ出す", 0, { 一時的状態: "魔無効" }),
      new 敵情報(2, "ﾊｸﾞﾚﾒﾀﾙ", 14, 61, 110, 4000, 2000, "022", 1500, 30, "ﾊｸﾞﾚﾒﾀﾙ", 25, "逃げ出す", 0, { 一時的状態: "魔無効" }),
      new 敵情報(1, "ﾒﾀﾙｷﾝｸﾞ", 25, 199, 200, 8000, 2000, "517", 4000, 100, "ﾊｸﾞﾚﾒﾀﾙ", 999, "逃げ出す", 0, { 一時的状態: "魔無効" })
    ]);
    new クエスト情報("幻の秘境", "stage17.gif", [
      [...アイテム.名前範囲("ひのきの棒", "破壊の鉄球")],
      [...アイテム.名前範囲("布の服", "王者のﾏﾝﾄ")],
      [
        ...アイテム.名前範囲("薬草", "ｲﾝﾃﾘﾒｶﾞﾈ"),
        "福袋", "幸福袋",
        ...アイテム.名前範囲("馬のﾌﾝ", "金塊")
      ]
    ], [
      new 敵情報(undefined, "人食い箱", 1000, 500, 350, 50, 400, "090", 200, 400, "眠り系", 999, "無職", 20, { 一時的状態: "２倍" }),
      new 敵情報(undefined, "ﾐﾐｯｸ", 1500, 500, 360, 100, 700, "091", 400, 800, "即死系", 999, "無職", 20, { 命中率: 150, 一時的状態: "２倍" }),
      new 敵情報(undefined, "ﾊﾟﾝﾄﾞﾗﾎﾞｯｸｽ", 2000, 999, 370, 150, 800, "092.gif", 600, 1000, "即死系", 93, "無職", 20, { 命中率: 150, 一時的状態: "２倍" }),
      new 敵情報(undefined, "ﾄﾗｯﾌﾟﾎﾞｯｸｽ", 2500, 999, 380, 200, 900, "575", 800, 2000, "闇魔道士", 999, "即死系", 999, { 命中率: 200, 一時的状態: "２倍" })
    ], [
      new 敵情報(1, "ｺﾛﾋｰﾛｰ", 270, 200, 300, 150, 150, "100", 99, 50, "勇者", 999, "無職", 20, { 命中率: 70 }),
      new 敵情報(1, "ｺﾛﾌｧｲﾀｰ", 280, 100, 320, 250, 50, "101", 99, 50, "戦士", 999, "無職", 20, { 命中率: 70 }),
      new 敵情報(1, "ｺﾛﾏｰｼﾞ", 240, 400, 150, 100, 300, "102", 99, 50, "魔法使い", 999, "無職", 20, { 命中率: 70 }),
      new 敵情報(1, "ｺﾛﾌﾟﾘｰｽﾄ", 250, 300, 200, 150, 200, "103", 99, 50, "僧侶", 999, "無職", 20, { 命中率: 70 }),
      new 敵情報(1, "ﾌﾟﾁﾋｰﾛｰ", 320, 250, 280, 150, 150, "105", 99, 50, "勇者", 999, "無職", 20),
      new 敵情報(1, "ﾌﾟﾁﾌｧｲﾀｰ", 340, 150, 320, 250, 50, "106", 99, 50, "戦士", 999, "無職", 20),
      new 敵情報(1, "ﾌﾟﾁﾏｰｼﾞ", 250, 300, 150, 100, 300, "107", 99, 50, "魔法使い", 999, "無職", 20),
      new 敵情報(1, "ﾌﾟﾁﾌﾟﾘｰｽﾄ", 270, 250, 200, 150, 200, "108", 99, 50, "無職", 20)
    ]);
    new クエスト情報("闇のランプ", "stage18.gif", [
      [...アイテム.名前範囲("ｶﾞｲｱの剣", "魔人の斧")],
      [...アイテム.名前範囲("ﾄﾞﾗｺﾞﾝﾛｰﾌﾞ", "魔人の鎧")],
      ["闇のｵｰﾌﾞ", "次元のｶｹﾗ", "次元のｶｹﾗ"]
    ], [
      new 敵情報(undefined, "悪の右目", 3000, 999, 380, 200, 200, "580", 500, 100, "ﾀﾞｰｸｴﾙﾌ", 999, "悪魔", 999, { 命中率: 250, 一時的状態: "魔無効" }),
      new 敵情報(undefined, "悪の口", 5000, 3000, 450, 30, 300, "582", 700, 300, "ﾄﾞﾗｺﾞﾝ", 999, "ﾊﾞﾝﾊﾟｲｱ", 999, { 命中率: 250, 一時的状態: "攻反撃" }),
      new 敵情報(undefined, "悪の左目", 3000, 999, 380, 250, 200, "581", 500, 100, "ｴﾙﾌ", 999, "ｱｲﾃﾑ士", 90, { 命中率: 250, 一時的状態: "魔無効" })
    ], [
      new 敵情報(1, "黒ｽﾗｲﾑ", 250, 302, 300, 180, 250, "160", 95, 85, "ｽﾗｲﾑ", 999, "無職", 20, { 一時的状態: "魔吸収" }),
      new 敵情報(1, "黒ﾄﾞﾗｷｰ", 330, 333, 380, 50, 300, "161", 85, 65, "ﾊﾞﾝﾊﾟｲｱ", 90, "無職", 20, { 状態異常: "混乱" }),
      new 敵情報(1, "黒ﾏﾈﾏﾈ", 300, 362, 250, 250, 250, "162", 66, 66, "ものまね士", 999, "無職", 20, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "黒ﾅｲﾄ", 380, 101, 390, 280, 100, "163", 96, 46, "戦士", 999, "無職", 20, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "黒ﾎﾞﾑ", 350, 155, 280, 250, 90, "164", 96, 46, "青魔道士", 20, "自爆系", 20, { 状態異常: "眠り" }),
      new 敵情報(1, "黒ﾄﾞｸﾛ", 240, 400, 270, 400, 160, "165", 88, 88, "ﾀﾞｰｸｴﾙﾌ", 999, "無職", 20, { 一時的状態: "魔軽減" })
    ]);
    new クエスト情報("封印の地", "stage19.gif", [
      [...アイテム.名前範囲("ﾃﾞｰﾓﾝｽﾋﾟｱ", "破壊の鉄球")],
      [...アイテム.名前範囲("ﾌﾞﾗｯﾄﾞﾒｲﾙ", "王者のﾏﾝﾄ")],
      [
        ...アイテム.名前範囲("賢者の石", "世界樹の葉"),
        "祈りの指輪",
        ...アイテム.名前範囲("ｽｷﾙの種", "小さなﾒﾀﾞﾙ"),
        "勇者の証", "邪神像", "闇のﾛｻﾞﾘｵ", "ｷﾞｬﾝﾌﾞﾙﾊｰﾄ", "ｼﾞｪﾉﾊﾞ細胞",
        ...アイテム.名前範囲("ｼﾙﾊﾞｰｵｰﾌﾞ", "天空の盾と兜"),
        ...アイテム.名前範囲("魔銃", "ｲﾝﾃﾘﾒｶﾞﾈ")
      ]
    ], [
      new 敵情報(undefined, "封印のﾂﾎﾞ", 15000, 5000, 450, 400, 200, "585", 1000, 100, "召喚系", 999, "召喚系", 999, { 命中率: 500, 一時的状態: "魔無効", 最大ＭＰ: 15000 })
    ], [
      new 敵情報(1, "封印石", 400, 200, 400, 400, 150, "180", 100, 100, "即死系", 999, { 一時的状態: "攻無効" }),
      new 敵情報(1, "封印石", 400, 200, 400, 400, 150, "181", 100, 100, "眠り系", 999, { 一時的状態: "魔無効" }),
      new 敵情報(1, "封印石", 400, 200, 400, 400, 150, "182", 100, 100, "麻痺系", 999, { 一時的状態: "魔無効" })
    ]);
    new クエスト情報("天空城", "stage20.gif", [
      [...アイテム.名前範囲("隼の剣", "ﾊｸﾞﾚﾒﾀﾙの剣")],
      [...アイテム.名前範囲("神秘の鎧", "ﾊｸﾞﾚﾒﾀﾙの鎧")],
      [...new 連続("天馬のたづな", 4)]
    ], [
      new 敵情報(undefined, "ｼﾙﾊﾞｰｽﾄｰﾝ", 20, 999, 500, 8000, 3000, "196", 100, 1000, "光魔道士", 999, "魔銃士", 999, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "片翼の天使", 12000, 8000, 500, 300, 300, "569", 3000, 2000, "超魔法型", 999, "堕天使", 999, { 命中率: 500, 最大ＭＰ: 30000, 一時的状態: "魔反撃" }),
      new 敵情報(undefined, "ﾌﾞﾗｯｸｽﾄｰﾝ", 20, 999, 500, 8000, 3000, "195", 100, 1000, "ﾀﾞｰｸｴﾙﾌ", 999, "蟲師", 999, { 一時的状態: "魔無効" })
    ], [
      new 敵情報(1, "天猫青", 400, 199, 400, 200, 400, "640", 100, 100, "羊飼い", 999, "召喚士", 999),
      new 敵情報(1, "天猫赤", 400, 199, 400, 200, 400, "641", 100, 100, "堕天使", 999, "赤魔道士", 999),
      new 敵情報(1, "天猫黄", 400, 199, 400, 200, 400, "642", 100, 100, "ﾁｮｺﾎﾞ", 999, "ﾊｸﾞﾚﾒﾀﾙ", 999),
      new 敵情報(1, "天卵", 500, 164, 350, 400, 150, "630", 150, 120, "天使", 999, "ﾓｰｸﾞﾘ", 999)
    ]);
    new クエスト情報("カオスフィールド", "stage21.gif", [
      [...アイテム.名前範囲("天空の剣", "ﾊｸﾞﾚﾒﾀﾙの剣")],
      [...アイテム.名前範囲("神秘の鎧", "ﾊｸﾞﾚﾒﾀﾙの鎧")],
      [...new 連続("天馬のたづな", 5)]
    ], [
      new 敵情報(undefined, "魔王", 14000, 4000, 650, 350, 200, "700", 2000, 1500, "魔王", 999, "暗黒騎士", 888, { 命中率: 250, 一時的状態: "攻反撃", 最大ＭＰ: 10000 }),
      new 敵情報(undefined, "ｶﾀｽﾄﾛﾌｨｰ", 15000, 8000, 750, 400, 400, "801", 5000, 3000, "超攻撃型", 999, "ｿﾙｼﾞｬｰ", 999, { 命中率: 500, テンション: 100, 最大ＭＰ: 30000 }),
      new 敵情報(undefined, "死神", 14000, 5000, 600, 250, 999, "702", 2000, 1500, "闇魔道士", 999, "ｷﾞｬﾝﾌﾞﾗｰ", 999, { 命中率: 250, 一時的状態: "魔反撃", 最大ＭＰ: 14000 })
    ], [
      new 敵情報(1, "ﾋﾞｯｸｽﾗｲﾑ", 500, 0, 500, 100, 500, "006", 120, 50, undefined, undefined, "無職", 20, { 一時的状態: "回復" }),
      new 敵情報(1, "人面樹", 700, 263, 550, 200, 250, "503", 170, 140, "商人", 999, "無職", 20, { 一時的状態: "復活" }),
      new 敵情報(1, "亡霊剣士", 860, 343, 650, 200, 150, "500", 180, 80, "剣士", 999, "無職", 20, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "ｷﾗｰｼｪﾙ", 600, 452, 700, 600, 300, "215", 150, 300, "戦士", 999, "無職", 20, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "ﾃﾞﾋﾞﾙｼｪﾙ", 1000, 600, 500, 700, 200, "506", 160, 500, "僧侶", 999, "無職", 30, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "ｺﾞｰﾚﾑ", 1200, 777, 500, 700, 150, "546", 250, 150, "風水士", 999, "無職", 30, { 一時的状態: "攻軽減" }),
      new 敵情報(1, "闇の魔術士", 800, 300, 450, 200, 200, "510", 180, 260, "ﾊｸﾞﾚﾒﾀﾙ", 999, { 一時的状態: "魔吸収" }),
      new 敵情報(1, "ｷﾞｶﾞﾝﾃｽ", 909, 909, 909, 100, 100, "563", 200, 5, "ﾊﾞｰｻｰｶｰ", 999, { テンション: 100 }),
      new 敵情報(1, "ひくいどり", 1100, 997, 530, 270, 380, "530", 180, 180, "忍者", 999, "風水士", 999, { 一時的状態: "息軽減" }),
      new 敵情報(1, "ﾍﾞﾋｰﾓｽ", 909, 909, 777, 255, 555, "553", 211, 99, "竜騎士", 999, "ﾓﾝｸ", 999, { 一時的状態: "大防御" }),
      new 敵情報(1, "ｷﾝｸﾞｽﾗｲﾑ", 1200, 999, 500, 300, 500, "516", 200, 250, "ﾊﾞｰｻｰｶｰ", 999, "無職", 20, { 一時的状態: "攻無効" }),
      new 敵情報(1, "死霊の騎士", 1200, 999, 666, 280, 280, "566", 240, 170, "魔剣士", 999, "剣士", 999, { 一時的状態: "受流し" }),
      new 敵情報(1, "竜王", 1500, 999, 750, 440, 200, "560", 250, 200, "ﾄﾞﾗｺﾞﾝ", 999, "ﾓﾝｸ", 999, { 一時的状態: "息反撃" })
    ]);
    封印戦情報.初期化();
    ダンジョン情報.初期化();
  }
}

class 封印戦情報 extends クエスト情報 {
  constructor(名前, 最大参加人数, リーダー名, 行動秒数, 参加条件, ...引数) {
    super(名前, ...引数);
  }

  static 初期化() {
    new 封印戦情報("全てを無に還す者", 6, "破壊神", 12, new クエスト参加条件(ステータス.ＨＰ, 400, true), [
      空配列,
      空配列,
      [
        ...new 連続("天馬のたづな", 4),
        "天空の盾と兜", "次元のｶｹﾗ"
      ]
    ], [
      new 敵情報(undefined, "ﾚｯﾄﾞｽﾄｰﾝ", 50, 999, 400, 9000, 3000, "190", 1000, 2000, "忍者", 999, "魔法使い", 999, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "ﾌﾞﾙｰｽﾄｰﾝ", 50, 999, 500, 9000, 3000, "191", 1000, 2000, "賢者", 130, "青魔道士", 999, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "ｲｴﾛｰｽﾄｰﾝ", 50, 999, 500, 9000, 3000, "192", 1000, 2000, "ものまね士", 999, "結界士", 999, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "破壊神", 150_000, 999_999, 600, 300, 300, "850", 10000, 5000, "超攻撃型", 999, { 命中率: 2000, 一時的状態: "攻軽減", 最大ＭＰ: 9_999_999 }),
      new 敵情報(undefined, "ｸﾞﾘｰﾝｽﾄｰﾝ", 50, 99999, 500, 9000, 3000, "193", 1000, 2000, "猛毒系", 999, "麻痺系", 999, { 一時的状態: "魔無効", 最大ＭＰ: 999999 }),
      new 敵情報(undefined, "ﾊﾟｰﾌﾟﾙｽﾄｰﾝ", 50, 999, 500, 9000, 3000, "194", 1000, 2000, "魔王", 999, "眠り系", 999, { 一時的状態: "魔無効" }),
      new 敵情報(undefined, "ｼﾙﾊﾞｰｽﾄｰﾝ", 50, 99999, 500, 9000, 3000, "196", 500, 2000, "闇魔道士", 999, "悪魔", 999, { 一時的状態: "魔無効", 最大ＭＰ: 999999 }),
    ], 空配列);
    new 封印戦情報("全てを憎む者", 6, "暗黒竜", 12, new クエスト参加条件(ステータス.ＨＰ, 400, true), [
      空配列,
      空配列,
      [
        ...new 連続("天馬のたづな", 4),
        "天空の盾と兜", "次元のｶｹﾗ"
      ]
    ], [
      new 敵情報(undefined, "暗黒竜", 140_000, 99_999, 300, 200, 0, "710", 8000, 5000, "無職", 999, "暗黒竜のﾀﾏｺﾞ", 999, { 命中率: 900, 一時的状態: "受流し", 最大ＭＰ: 999_999 })
    ], [
      new 敵情報(1, "竜王", 600, 299, 550, 400, 100, "560", 250, 100, "ﾄﾞﾗｺﾞﾝ", 999, "ﾓﾝｸ", 999, { 一時的状態: "息反撃" }),
      new 敵情報(1, "火竜", 600, 299, 550, 400, 100, "561", 250, 100, "魔王", 999, "麻痺系", 999, { 一時的状態: "息反撃" }),
      new 敵情報(1, "水竜", 600, 299, 550, 400, 100, "562", 250, 100, "ﾄﾞﾗｺﾞﾝ", 999, "風水士", 999, { 一時的状態: "息反撃" }),
      new 敵情報(1, "ﾍﾞﾋｰﾓｽ", 480, 209, 500, 240, 400, "553", 240, 90, "竜騎士", 999, "ﾓﾝｸ", 999, { 一時的状態: "大防御" }),
      new 敵情報(1, "ｷﾝｸﾞﾍﾞﾋｰﾓｽ", 540, 209, 500, 240, 400, "554", 240, 90, "ﾊﾞｰｻｰｶｰ", 999, "ﾓﾝｸ", 999, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "ｲﾌﾘｰﾄ", 540, 209, 500, 240, 400, "555", 240, 90, "天竜人", 150, "魔人", 999, { 一時的状態: "攻無効" }),
      new 敵情報(1, "ﾄﾞﾗｺﾞﾝﾏｯﾄ", 480, 99, 600, 360, 150, "556", 200, 100, "ﾄﾞﾗｺﾞﾝ", 999, "無職", 20, { 一時的状態: "受流し" }),
      new 敵情報(1, "ﾄﾞﾗｺﾞﾝｿﾞﾝﾋﾞ", 560, 192, 520, 300, 120, "557", 255, 100, "ﾀﾞｰｸｴﾙﾌ", 999, "魔人", 999, { 一時的状態: "復活" })
    ]);
    new 封印戦情報("全てを破壊する者", 6, "悪魔の書", 12, new クエスト参加条件(ステータス.ＨＰ, 300, true), [
      空配列,
      空配列,
      [
        ...new 連続("天馬のたづな", 2),
        ...new 連続("天空の盾と兜", 2)
      ]
    ], [
      new 敵情報(undefined, "悪魔の書", 160_000, 99_999, 100, 100, 700, "615", 5000, 5000, "超魔法型", 999, "召喚", 999, { 最大ＭＰ: 999_999, 一時的状態: "魔無効" })
    ], [
      new 敵情報(1, "一賢者", 250, 399, 100, 60, 300, "508", 70, 150, "光魔道士", 999, "白魔道士", 999, { 一時的状態: "魔無効" }),
      new 敵情報(1, "二賢者", 250, 299, 100, 60, 300, "507", 70, 150, "黒魔道士", 999, "ﾊｸﾞﾚﾒﾀﾙ", 999, { 一時的状態: "魔吸収" }),
      new 敵情報(1, "三賢者", 250, 399, 100, 60, 300, "509", 70, 150, "魔法使い", 999, "闇魔道士", 999, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "四賢者", 250, 399, 100, 60, 300, "511", 70, 150, "賢者", 999, "赤魔道士", 999, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "青魔", 400, 299, 200, 100, 400, "250", 70, 150, "青魔道士", 999, "召喚系", 999, { 一時的状態: "魔吸収" }),
      new 敵情報(1, "黒魔", 320, 301, 120, 60, 300, "254", 80, 160, "黒魔道士", 999, "召喚系", 999, { 一時的状態: "魔無効" }),
      new 敵情報(1, "ﾐﾆﾓﾝ", 350, 301, 500, 200, 500, "245", 66, 66, "ﾐﾆﾃﾞｰﾓﾝ", 999, "召喚系", 999, { 状態異常: "混乱" }),
      new 敵情報(1, "ｽﾗｲﾑまどう", 260, 384, 180, 50, 400, "013", 100, 150, "闇魔道士", 999, "ﾊｸﾞﾚﾒﾀﾙ", 999)
    ]);
    new 封印戦情報("全てを呪う者", 6, "暗黒の盾", 12, ステータス.ＨＰ, 300, true, [
      空配列,
      空配列,
      ["天馬のたづな", "天空の盾と兜", "宝物庫の鍵"]
    ], [
      new 敵情報(undefined, "暗黒の剣", 100_000, 99_999, 500, 200, 250, "707", 6000, 3000, "暗黒騎士", 999, "召喚系", 999, { 命中率: 900, 最大ＭＰ: 999_999, 一時的状態: "攻反撃" }),
      new 敵情報(undefined, "暗黒の盾", 100_000, 99_999, 300, 600, 250, "708", 7000, 4000, "魔王", 999, "召喚系", 999, { 命中率: 900, 最大ＭＰ: 999_999, 一時的状態: "魔反撃" })
    ], [
      new 敵情報(1, "悪魔の剣", 350, 301, 500, 200, 150, "620", 200, 50, "悪魔", 999, "ﾊﾞｰｻｰｶｰ", 999, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "闇の剣", 350, 301, 500, 200, 150, "621", 200, 50, "暗黒騎士", 99, "ｱｻｼﾝ", 999, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "呪の剣", 350, 301, 500, 200, 150, "622", 200, 50, "剣士", 999, "魔剣士", 999, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "悪魔の盾", 350, 301, 200, 500, 200, "623", 150, 100, "悪魔", 999, "堕天使", 999, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "呪の盾", 350, 301, 200, 500, 200, "624", 150, 100, "ﾀﾞｰｸｴﾙﾌ", 999, "ﾐﾆﾃﾞｰﾓﾝ", 999, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "闇の盾", 350, 301, 200, 500, 200, "625", 150, 100, "闇魔道士", 999, "青魔道士", 999, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "魔王の剣", 350, 301, 400, 400, 300, "626", 200, 100, "魔王", 999, "召喚士", 999, { 一時的状態: "攻反撃" })
    ]);
    new 封印戦情報("全てを支配する者", 6, "ﾄﾞｰﾙﾏｽﾀｰ", 12, new クエスト参加条件(ステータス.ＨＰ, 200, true), [
      空配列,
      空配列,
      [
        "天馬のたづな",
        ...new 連続("天空の盾と兜", 2),
        "宝物庫の鍵"
      ]
    ], [
      new 敵情報(undefined, "ﾄﾞｰﾙﾏｽﾀｰ", 150_000, 999_999, 500, 250, 350, "705", 8000, 4000, "妖精", 999, "ﾄﾞｰﾙﾏｽﾀｰ", 999, { 命中率: 1000, 一時的状態: "100倍", 状態異常: "全封", 最大ＭＰ: 9_999_999 })
    ], 空配列);
    new 封印戦情報("二重世界", 6, "闇のｸﾘｽﾀﾙ", 12, ステータス.ＨＰ, 200, true, [
      空配列,
      空配列,
      [
        "小さなﾒﾀﾞﾙ", "天馬のたづな",
        ...アイテム.名前範囲("ｼﾙﾊﾞｰｵｰﾌﾞ", "ﾊﾟｰﾌﾟﾙｵｰﾌﾞ"),
        "宝物庫の鍵"
      ]
    ], [
      new 敵情報(undefined, "闇のｸﾘｽﾀﾙ", 150_000, 99_999, 500, 300, 300, "706", 4000, 3000, "召喚系", 999, "召喚系", 999, { 命中率: 900, 最大ＭＰ: 999_999, 一時的状態: "魔反撃" })
    ], [
      new 敵情報(1, "悪魔の鏡", 300, 301, 400, 300, 300, "570", 99, 50, "悪魔", 999, "ものまね士", 999, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "呪いの鏡", 300, 301, 400, 300, 300, "571", 99, 50, "ﾀﾞｰｸｴﾙﾌ", 999, "ものまね士", 999, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "暗黒の鏡", 300, 301, 400, 300, 300, "572", 99, 50, "暗黒騎士", 999, "ものまね士", 999, { 一時的状態: "魔反撃" }),
      new 敵情報(1, "月夜の鏡", 300, 301, 400, 300, 300, "573", 99, 50, "光魔道士", 999, "ものまね士", 999, { 一時的状態: "魔反撃" }),
    ]);
    new 封印戦情報("全てを爆発させる者", 6, "ﾎﾞﾏｰ", 12, ステータス.ＨＰ, 200, true, [
      空配列,
      ["ｽﾃﾃｺﾊﾟﾝﾂ"],
      [
        "爆弾石",
        ...new 連続("ﾌｧｲﾄ一発", 2),
        ...new 連続("ｴｯﾁな本", 4),
        ...new 連続("天馬のたづな", 2)
      ]
    ], [
      new 敵情報(undefined, "ﾎﾞﾏｰ", 60_000, 99_999, 450, 250, 150, "652", 5000, 1, "遊び人", 999, "召喚系", 999, { 最大ＭＰ: 999_999, 一時的状態: "大爆発", 状態異常: "するぞ" })
    ], [
      new 敵情報(1, "爆弾岩", 150, 42, 300, 300, 50, "080", 90, 5, "自爆系", 20, "無職", 30),
      new 敵情報(1, "爆弾王", 300, 42, 400, 300, 100, "579", 180, 20, "自爆系", 20, "無職", 30),
      new 敵情報(1, "ﾎﾞﾑ", 200, 42, 350, 60, 400, "071", 100, 50, "青魔道士", 20, "無職", 30),
      new 敵情報(1, "ﾋﾞｯｸﾎﾞﾑ", 400, 42, 450, 120, 280, "577", "青魔道士", 30, "無職", 30),
      new 敵情報(1, "ﾁﾋﾞﾎﾞﾑ", 50, 42, 300, 900, 900, "208", 100, 1, "自爆系", 20, "無職", 30, { 一時的状態: "魔無効" }),
      new 敵情報(1, "ｷﾗｰﾎﾞﾑ", 100, 42, 400, 700, 900, "209", 150, 10, "自爆系", 20, "無職", 30)
    ]);
    new 封印戦情報("闇でおおいつくす者", 6, "魔人のﾂﾎﾞ", 12, ステータス.ＨＰ, 400, false, [
      空配列,
      空配列,
      [
        ...new 連続("小さなﾒﾀﾞﾙ", 3),
        "天馬のたづな",
        ...アイテム.名前範囲("天馬のたづな", "ﾊﾟｰﾌﾟﾙｵｰﾌﾞ"),
        "宝物庫の鍵"
      ]
    ], [
      new 敵情報(undefined, "魔人のﾂﾎﾞ", 80_000, 99_999, 300, 400, 250, "605", 2500, 2000, "召喚系", 999, "召喚系", 999, { 命中率: 800, 最大ＭＰ: 999_999, 一時的状態: "攻軽減" })
    ], [
      new 敵情報(1, "青魔人", 250, 300, 380, 50, 150, "606", 100, 70, "武闘家", 999, "無職", 20, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "赤魔人", 250, 300, 380, 50, 150, "607", 100, 70, "戦士", 999, "無職", 20, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "黒魔人", 250, 300, 380, 50, 150, "608", 100, 70, "魔人", 999, "無職", 20, { 一時的状態: "攻反撃" }),
      new 敵情報(1, "白魔人", 250, 300, 380, 50, 150, "609", 100, 70, "ﾓﾝｸ", 999, "無職", 20, { 一時的状態: "攻反撃" })
    ]);
    new 封印戦情報("悪の城", 6, "悪の城", 12, ステータス.ＨＰ, 200, false, [
      空配列,
      空配列,
      [
        ...new 連続("小さなﾒﾀﾞﾙ", 2),
        ...アイテム.名前範囲("薬草", "ﾎﾋﾞｯﾄ"),
        ... new 連続("天馬のたづな", 2),
        ...アイテム.名前範囲("身代わり人形", "禁じられた果実"),
        ...アイテム.名前範囲("小人のﾊﾟﾝ", "復活の草"),
        "宝物庫の鍵"
      ]
    ], [
      new 敵情報(undefined, "悪の城", 30_000, 99_999, 150, 150, 100, "603", 1800, 2000, "召喚系", 999, "召喚系", 999, { 命中率: 800, 最大ＭＰ: 999_999, 一時的状態: "攻軽減" })
    ], [
      new 敵情報(1, "ﾐﾗｰﾅｲﾄ", 150, 94, 150, 100, 150, "520", 50, 50, "ものまね士", 999),
      new 敵情報(1, "地獄の鎧", 166, 66, 116, 66, 66, "240", 66, 66, "騎士", 40, "無職", 30),
      new 敵情報(1, "地獄の騎士", 166, 66, 166, 66, 66, "223", 66, 66, "魔剣士", 50, "暗黒騎士", 20),
      new 敵情報(1, "ﾌﾞﾙｰﾅｲﾄ", 120, 85, 150, 60, 50, "519", 50, 30, "竜騎士", 50, "無職", 20),
      new 敵情報(1, "ﾌﾞﾗｯｸﾅｲﾄ", 196, 96, 196, 96, 96, "524", 96, 96, "ﾊﾞｰｻｰｶｰ", 999, "暗黒騎士", 20)
    ]);
    new 封印戦情報("無限に増殖する者", 6, "ｽﾗｲﾑﾎﾞｯｸｽ", 12, ステータス.ＨＰ, 100, false, [
      空配列,
      空配列,
      [
        ...アイテム.名前範囲("薬草", "へんげの杖"),
        "天馬のたづな",
        ...アイテム.名前範囲("身代わり人形", "禁じられた果実"),
        ...アイテム.名前範囲("小人のﾊﾟﾝ", "復活の草"),
        "宝物庫の鍵"
      ]
    ], [
      new 敵情報(undefined, "ｽﾗｲﾑﾎﾞｯｸｽ", 15_000, 9_999, 60, 0, 0, "600", 1500, 500, "召喚系", 999, { 命中率: 300, 最大ＭＰ: 99_999, 一時的状態: "攻軽減" })
    ], [
      new 敵情報(1, "ﾌﾞﾁｽﾗｲﾑ", 20, 0, 36, 0, 20, "001", 6, 3, undefined, undefined, "無職", 20),
      new 敵情報(1, "ｽﾗｲﾑ", 25, 0, 40, 0, 20, "002", 9, 4, undefined, undefined, "無職", 20),
      new 敵情報(1, "ｽﾗｲﾑﾍﾞｽ", 30, 0, 45, 5, 25, "003", 10, 5, undefined, undefined, "無職", 20),
      new 敵情報(1, "ﾊﾞﾌﾞﾙｽﾗｲﾑ", 40, 52, 45, 10, 30, "020", 15, 10, "猛毒系", 20),
      new 敵情報(1, "ﾎｲﾐｽﾗｲﾑ", 40, 65, 35, 40, 20, "010", 20, 15, "僧侶", 6),
      new 敵情報(1, "ｽﾗｲﾑまどう", 40, 114, 30, 0, 45, "013", 24, 11, "闇魔道士", 16),
      new 敵情報(1, "ﾒﾀﾙｽﾗｲﾑ", 6, 51, 60, 2500, 1500, "004", 250, 10, "ｽﾗｲﾑ", 3, "逃げ出す", 0, { 一時的状態: "魔無効" })
    ]);
    new 封印戦情報("罪と罰", 4, undefined, 12, ステータス.ＨＰ, 200, true, [
      空配列,
      空配列,
      [
        ...アイテム.名前範囲("天馬のたづな", "ﾊﾟｰﾌﾟﾙｵｰﾌﾞ"),
        ...new 連続("宝物庫の鍵", 2)
      ]
    ], [
      new 敵情報(1, undefined, 50, 50, 2, 2, 2, undefined, 30, 30, undefined, undefined, { 一時的状態: "大防御" })
    ], 空配列); // TODO
  }
}